app/views/posts/_form.html.haml

SELECT "categories".* FROM "categories"
SELECT "tags".* FROM "tags"
---
    = f.label :category
    = f.select :category_id, Category.all.map{|c|[c.name, c.id]}
  .field
    = f.label :tags
    - Tag.all.each do |tag|