app/controllers/categories_controller.rb

  def create
    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "permalink", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 22 Mar 2013 23:58:35 UTC +00:00], ["name", "Caribbean"], ["permalink", "caribbean"], ["updated_at", Fri, 22 Mar 2013 23:58:35 UTC +00:00]]

  def update
    respond_to do |format|
      if @category.update_attributes(params[:category])
---
UPDATE "categories" SET "name" = 'US Pacific Coast', "updated_at" = '2013-03-22 23:59:26.108751' WHERE "categories"."id" = 2