app/controllers/main_controller.rb

  def index
    @posts = (@group ? @group.posts : Post).published.paginate page: params[:page]
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = 't' LIMIT 30 OFFSET 0

  def show_post
    sections = params[:category_and_post].split /\//
    not_found unless @category = Category.find_by_permalink(sections[0])
---
SELECT "categories".* FROM "categories" WHERE "categories"."permalink" = 'user' LIMIT 1

  def posts
    unless @category = Category.find_by_permalink(params[:permalink])
      @tag = Tag.find_by_permalink params[:permalink]
    end
    @group = @category || @tag

    @posts = (@group ? @group.posts : Post).published.paginate page: params[:page]
---
SELECT "categories".* FROM "categories" WHERE "categories"."permalink" IS NULL LIMIT 1
SELECT "tags".* FROM "tags" WHERE "tags"."permalink" IS NULL LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."published" = 't' LIMIT 30 OFFSET 0