app/controllers/posts_controller.rb

INSERT INTO "posts" ("category_id", "content", "created_at", "name", "permalink", "post_type", "published", "published_at", "tagline", "thumb_url", "title", "updated_at", "user_id", "video") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @post.user = current_user

    respond_to do |format|
      if @post.save