app/views/layouts/_header.html.haml

SELECT "categories".* FROM "categories" ORDER BY name
---
              %ul
                - Category.order(:name).all.each do |category|